In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.2.4'

In [4]:
np.__version__

'1.20.1'

In [9]:
my_list = [2,3,5,6,8]

In [10]:
number_series = np.array(my_list)
number_series

array([2, 3, 5, 6, 8])

In [11]:
number_series = pd.Series([2,3,5,6,8])
print(number_series)

0    2
1    3
2    5
3    6
4    8
dtype: int64

In [22]:
number_series = pd.Series([2,3,5,6,8], index = ['a', 'b', 'c', 'd', 'e'], name = 'Number')
print(number_series)

a    2
b    3
c    5
d    6
e    8
Name: Number, dtype: int64

In [24]:
print(number_series[0])
print(number_series['a'])

2
2

In [27]:
some_2D_array=  np.random.randint(1,6, (3,4))
some_2D_array

array([[5, 3, 1, 4],
       [1, 5, 1, 1],
       [4, 5, 1, 1]])

In [29]:
some_2D_array=  np.random.randint(1,6, (3,4))
first_datarame = pd.DataFrame(some_2D_array)
first_datarame

   0  1  2  3
0  3  3  1  5
1  2  2  3  1
2  5  1  1  1

In [30]:
some_2D_array=  np.random.randint(1,6, (3,4))
first_datarame = pd.DataFrame(some_2D_array , columns=['Akshay', 'Dev', 'Divya', 'Monika'])
first_datarame

   Akshay  Dev  Divya  Monika
0       3    3      1       2
1       2    3      5       3
2       1    3      2       2

In [32]:
first_datarame = pd.DataFrame(some_2D_array , columns= ['A', 'B', 'C', 'D'], index = ['First', 'Second', "Third"])
first_datarame

        A  B  C  D
First   3  3  1  2
Second  2  3  5  3
Third   1  3  2  2